src/stuf/stuf_bg/templates/stuf_bg/tests/responses/StufBgResponse.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xmlns:ns="http://www.egem.nl/StUF/sector/bg/0310" xmlns:StUF="http://www.egem.nl/StUF/StUF0301"
                  xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:gml="http://www.opengis.net/gml">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:npsLa01>
            <ns:stuurgegevens>
                <StUF:berichtcode>La01</StUF:berichtcode>
                <StUF:zender>
                    <StUF:organisatie>{{ ontvanger_organisatie }}</StUF:organisatie>
                    <StUF:applicatie>{{ ontvanger_applicatie }}</StUF:applicatie>
                    <StUF:administratie>{{ ontvanger_administratie }}</StUF:administratie>
                    <StUF:gebruiker>{{ ontvanger_gebruiker }}</StUF:gebruiker>
                </StUF:zender>
                <StUF:ontvanger>
                    <StUF:organisatie>{{ zender_organisatie }}</StUF:organisatie>
                    <StUF:applicatie>{{ zender_applicatie }}</StUF:applicatie>
                    <StUF:administratie>{{ zender_administratie }}</StUF:administratie>
                    <StUF:gebruiker>{{ zender_gebruiker }}</StUF:gebruiker>
                </StUF:ontvanger>
                <StUF:referentienummer>{{ referentienummer }}</StUF:referentienummer>
                <StUF:tijdstipBericht>{{ tijdstip_bericht }}</StUF:tijdstipBericht>
                <StUF:entiteittype>NPS</StUF:entiteittype>
            </ns:stuurgegevens>
            <ns:parameters>
                <StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
            </ns:parameters>
            <ns:antwoord>
                <ns:object StUF:entiteittype="NPS">
                    <ns:inp.bsn>999992314</ns:inp.bsn>
                    <ns:geslachtsnaam>Maykin</ns:geslachtsnaam>
                    <ns:voorvoegselGeslachtsnaam xsi:nil="true" StUF:noValue="geenWaarde"></ns:voorvoegselGeslachtsnaam>
                    <ns:voorletters>M</ns:voorletters>
                    <ns:voornamen>Media</ns:voornamen>
                    <ns:geslachtsaanduiding>M</ns:geslachtsaanduiding>
                    <ns:geboortedatum>19800915</ns:geboortedatum>
                    <ns:inp.geboorteplaats>Amsterdam</ns:inp.geboorteplaats>
                    <ns:inp.geboorteLand>6030</ns:inp.geboorteLand>
                    <ns:overlijdensdatum>19800915</ns:overlijdensdatum>
                    <ns:verblijfsadres>
                        <ns:wpl.woonplaatsNaam>Amsterdam</ns:wpl.woonplaatsNaam>
                        <ns:gor.straatnaam>Keizersgracht</ns:gor.straatnaam>
                        <ns:aoa.postcode>1015CJ</ns:aoa.postcode>
                        <ns:aoa.huisnummer>117</ns:aoa.huisnummer>
                        <ns:aoa.huisletter>A</ns:aoa.huisletter>
                        <ns:aoa.huisnummertoevoeging>B</ns:aoa.huisnummertoevoeging>
                    </ns:verblijfsadres>
                    <!--
                    <ns:sub.verblijfBuitenland>
                      <ns:lnd.landnaam>Paris</ns:lnd.landnaam>
                      <ns:sub.adresBuitenland1>Buitenland regel 1</ns:sub.adresBuitenland1>
                      <ns:sub.adresBuitenland2>Buitenland regel 2</ns:sub.adresBuitenland2>
                      <ns:sub.adresBuitenland3>Buitenland regel 3</ns:sub.adresBuitenland3>
                    </ns:sub.verblijfBuitenland>
                    <ns:inp.geboorteplaats>Amsterdam</ns:inp.geboorteplaats>
                    -->
                    <ns:inp.gemeenteVanInschrijving>1000</ns:inp.gemeenteVanInschrijving>
                    <ns:inp.datumInschrijving>20051216</ns:inp.datumInschrijving>
                    <ns:inp.heeftAlsEchtgenootPartner StUF:entiteittype="NPSNPSHUW" StUF:sleutelVerzendend="11870" StUF:sleutelGegevensbeheer="11870">
                        <ns:gerelateerde StUF:entiteittype="NPS" StUF:sleutelVerzendend="11865" StUF:sleutelGegevensbeheer="11865">
                            <ns:inp.bsn>149221897</ns:inp.bsn>
                            <ns:voornamenAanschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
                            <ns:geslachtsnaamAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
                        </ns:gerelateerde>
                    </ns:inp.heeftAlsEchtgenootPartner>
                </ns:object>
            </ns:antwoord>
        </ns:npsLa01>
    </soapenv:Body>
</soapenv:Envelope>
